programming/20230330161754-redis_expiration.org
:PROPERTIES:
:ID:       d7ec3a25-ea89-4ab5-ac11-dd4fd05f94a9
:END:
#+TITLE: redis expiration
#+CREATED: [2023-03-30 Thu 16:17]
#+LAST_MODIFIED: [2023-03-30 Thu 16:18]
* Expiration
In redis you can have keys expire.
This is useful for caching and for data that is irrelevant.
** EXPIRE
Set a timeout on a key, after which the key will be automatically deleted

Syntax: EXPIRE key seconds
#+begin_src shell
SET mykey "Hello"
EXPIRE mykey 10
#+end_src
#+RESULTS:
: OK
This sets the key "mykey" with value "Hello" and a timeout of 10 seconds. After 10 seconds, the key will be automatically deleted.
** PEXPIRE
Similar to EXPIRE, but accepts the timeout in milliseconds instead of seconds.

** TTL
Check the remaining time to live of a key

Syntax: TTL key
Example:
#+begin_src shell
SET mykey "Hello"
EXPIRE mykey 10
TTL mykey
#+end_src
#+RESULTS:
: 10
This sets the key "mykey" with value "Hello" and a timeout of 10 seconds. The TTL command returns the remaining time to live of the key, which is initially 10 seconds.
** PTTL
Like TTL, but returns the remaining time to live in milliseconds.

** PERSIST
Remove the timeout on a key, making it persist indefinitely

Syntax: PERSIST key
Example:
#+begin_src shell
SET mykey "Hello"
EXPIRE mykey 10
PERSIST mykey
TTL mykey
#+end_src
#+RESULTS:
: -1
This sets the key "mykey" with value "Hello" and a timeout of 10 seconds. The PERSIST command removes the timeout on the key, making it persist indefinitely. The TTL command returns -1, indicating that the key has no timeout.
** SETEX
Set a key with a timeout in one command

Syntax: SETEX key seconds value
#+begin_src shell
SETEX mykey 10 "Hello"
TTL mykey
#+end_src
#+RESULTS:
: 10
This sets the key "mykey" with value "Hello" and a timeout of 10 seconds in one command. The TTL command returns the remaining time to live of the key, which is initially 10 seconds.
